project-api/app/Controllers/Login.php

    public function index() {
        $userModel = new UserApiModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'user@gmail.com'
 LIMIT 1