project-api/app/Controllers/Register.php

    public function index() {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_emails|is_unique[users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password' => ['label' => 'confirm password', 'rules' => 'matches[password]']
        ];

        if($this->validate($rules)) {
            $model = new UserModel();
            $data = [
                'email' => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `password`) VALUES ('user@gmail.com', '$2y$10$2bqU98hJrMjFLE9hIjh2ouObADD/nmwGpFS6SzrVRIHM.dBXM65Nq')