project-api/app/Controllers/Services.php

SELECT *
FROM `services`
---
    public function index()
    {
        header('Access-Control-Allow-Origin: *'); // Permite todas las orígenes. Cambia '*' por tu dominio si es necesario.
        header('Access-Control-Allow-Methods: GET, POST, OPTIONS');
        header('Access-Control-Allow-Headers: Content-Type, Authorization');
        $services = new ServicesModel;
        return $this->respond(['services' => $services->findAll()], 200);