project-api/app/Controllers/UserApi.php

SELECT *
FROM `users_api`
---
    public function index() {
        $users_api = new UserApiModel;
        return $this->respond(['users_api' => $users_api->findAll()], 200);